backend/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "pages", "date_finished", "characters", "problem", "solution", "genre_rationale", "words_learned", "something_learned", "question", "genre_name", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "genre_name" = ?, "date_finished" = ?, "problem" = ?, "solution" = ?, "genre_rationale" = ?, "words_learned" = ?, "something_learned" = ?, "question" = ?, "updated_at" = ? WHERE "books"."id" = ?